Revit 2026 API

# BuiltInFailuresExtrusionFailures Class

---

Failures about Extrusions.

SystemObject Autodesk.Revit.DBBuiltInFailuresExtrusionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExtrusionFailures
```
```vb
Public NotInheritable Class ExtrusionFailures
```
```cpp
public ref class ExtrusionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExtrusionFailures = class end
```

The BuiltInFailuresExtrusionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawExtrusions | Can't make Extrusion. |
|  | CannotDrawExtrusionsError | Can't make Extrusion. |
|  | ExtrusionTooThin | Extrusion is too thin. |
|  | InvalidExtrusionCurveloop | Base sketch for extrusion is invalid. |
|  | InvalidExtrusionCurveloopError | Base sketch for extrusion is invalid. |

#### Reference

Autodesk.Revit.DB Namespace